Repository: giellalt/corpus-sme
Catalog: tmx/nob/admin/sd/samediggi.no/beaska-niillas.html.tmx
Source language: sme
Languages: nob

source: Beaska Niillas / Áirasat / Sámedikki birra / Sámediggi - Sametinget
nob: Beaska Niillas / Representanter / Om Sametinget / Forsiden - Sametinget

source: Beaska Niillas
nob: Fødselsdato:

source: NSR.
nob: Sivilstatus: Gift, 2 barn.

source: / SÁB
nob: Yrke

source: beaska.niillas@samediggi.no
nob: Leder for Kautokeino pistolklubb
